<script setup>
import NewsBlock from "@/components/NewsBlock.vue";
import VideoItem from "@/components/VideoItem.vue";
import SocialLink from "@/components/SocialLink.vue";

const linksSocials = [
  { name: "facebook" },
  { name: "instagram" },
  { name: "telegram" },
];
</script>

<template>
  <wrapper-page class="new" p="0">
    <div class="new__wrapper wrap-content">
      <container small title="Все буде так, як ти захочеш!" mb="0">
        <div class="new__date">12.11.2021</div>
        <div class="new__block">
          <p class="new__text">
            Антитіла та Марина Бех-Романчук прожили у кадрі ціле життя. Гучна
            прем’єра від гурту Антитіла. Після танцювальної пісні «Маскарад»,
            яка досі займає перші позиції хіт-парадів на радіо та набирає
            мільйони переглядів в YouTube, Антитіла презентують ліричну пісню.
            Як завжди з філософським підтекстом.
          </p>
          <hr class="new__line" />
          <div class="new__links">
            <social-link
              v-for="link in linksSocials"
              :key="link.name"
              :link="link"
              fill="#2D2D2D"
              size="32"
            />
          </div>
          <div class="new__image border-class">
            <u-img :src="`/images/new_1.jpg`" alt="item.title" />
          </div>
          <p class="new__text">
            Пісня про життєвий шлях та внутрішню силу втілювати мрії з
            мотивуючою назвою «Стань». В кадрі – гурт Антитіла та одна з
            найсильніших легкоатлеток світу - Марина Бех-Романчук. <br /><br />
            Цього разу головну роль виконала спортсменка, багаторазова чемпіонка
            України, чемпіонка Європи, призерка чемпіонату світу, учасниця
            Олімпійських ігор 2016 та 2021 – Марина Бех-Романчук.
            <br /><br />
            «Коли ми затвердили ідею кліпу, то почали шукати головну героїню.
            Якось одразу вирішили, що це має бути дівчина. Ознайомилися з усіма
            спортсменками в категорії легкої атлетики, потім навіть думали над
            футболістками, але коли побачили Марину, то зрозуміли, що саме вона
            - наша героїня. Ми перечитали десятки інтерв’ю, передивилися записи
            змагань, вивчили соціальні мережі. І знаєте, ми не прогадали. Марина
            чудово справилася. На знімальний майданчик прилетіла з чергових
            змагань у Австрії, знайшла час у щільному графіку» - ділиться
            продюсер гурту Сергій Вусик.
            <br /><br />
            «Марина – це квінтесенція краси, неймовірної сили та наполегливості.
            При всьому цьому вона дуже проста у спілкуванні, відкрита до людей.
            І, на нашу думку, в кадрі вона виглядає прекрасно. Ви і самі можете
            переконатися в цьому, переглянувши кліп. А ще ми були приємно
            здивовані, як вони з чоловіком, Михайлом, олімпійським призером,
            чемпіоном Європи з плавання, світовим рекордсменом, підтримують один
            одного. Між ними відчувається любов, обоє пройшли нелегкий шлях до
            успіху і знають ціну перемог», - розповідає Тарас Тополя.
          </p>
          <video-item id="2" class="new__video" />
          <p class="new__text">
            «Коли мені зателефонував Сергій Вусик, директор гурту Антитіла, і
            запропонував взяти участь у зйомках кліпу я спочатку мала великі
            сумніви. Це був складний період після Олімпіади, думки були зовсім
            про інше. Але коли я почула ідею, побачила розкадровки кліпу,
            порадилася з близькими – я погодилася. Це абсолютно новий досвід, я
            навіть можу прирівняти це до зйомок в кіно, адже в результаті ми
            маємо міні-фільм. Також зі мною на майданчику завжди був присутній
            мій коханий, що дуже допомагало».<br /><br />
            Зйомки тривали дві повних доби. Усе відбувалося в Києві, у
            легкоатлетичному манежі, що на Березняках. Антитіла повністю
            видозмінили спортивну арену, використавши тисячі квадратних метрів
            чорного полотна, яким закрили периметр манежу від сонячного
            проміння. Підвісили декілька тон світлових приладів, завезли на
            територію дві вантажівки знімальної техніки, аби отримати бажану
            картинку.<br /><br />
            Окрім Марини Бех-Романчук, в кадрі з’являються друзі гурту Антитіла.
            Серед них справжні спортсмени – марафонці з клубу KMRC - айтішники,
            юристи, бізнесмени, для яких окрім їхньої професії існує ще одна
            улюблена справа – спорт. Для більшості – це перші зйомки у їхньому
            житті. Після зйомок кліпу, ще 2 місяці тривала робота на графікою,
            за яку взялася краща post-production команда країни “Headshot
            studio”. Все для того, щоб досягнути бажаного візуального ефекту.<br /><br />
            «Пісню створили більше року тому, вона записана на студії досить
            давно, але для відео-реалізації ідеї закладеної в цю композицію нам
            потрібно було трішки часу. При написанні пісні ми надихалися
            атмосферою шкільних випускних, коли хлопці та дівчата зізнаються
            один одному в коханні, клянуться у вічній дружбі, ставлять цілі і
            вірять у свої мрії, коли все щиро і без фальші. Згодом з’явилася
            ідея кліпу. В голові виникали бігові доріжки, які відображали дорогу
            життя, великий простір, де кожен біжить по своїй лінії до мети. В
            процесі підготовки ми зрозуміли, що потрібна масштабна картинка, у
            якій можливо передати плин життя і людей в ньому. Зі своїми
            бажаннями, мріями і «хрестами, які дехто тягне на своїх плечах». Ми
            впевнені, що кожен зможе впізнати в певних кадрах себе або когось зі
            свого оточення. А ще у кліпу досить неочікуване завершення, по суті,
            історія відео починається у його фіналі, а якщо зануритися у відео
            ще глибше, то розумієш що ньому немає ні початку ні кінця. І, як
            завжди, є приховані секрети, пасхалки, від Антитіл», - розповідає
            Тарас Тополя. <br /><br />«Стань» - це третя пісня майбутнього
            альбому, прем’єру якого Антитіла запланували на початок 2022 року.
            Після випуску альбому Антитіла вирушать у стадіонний тур, де
            представлять абсолютно нове шоу та презентують новий альбом. Перший
            концерт запланований на травень 2022 року у місті Дніпро. Також
            артисти успішно завершили тур Hello, який почали ще на початку 2020
            року.
          </p>
        </div>
      </container>
    </div>
    <news-block bg left title="Читайте також:" :quantity="4" />
  </wrapper-page>
</template>

<style lang="scss" scoped>
.new {
  &__date {
    text-align: center;
    font-size: 0.875rem;
    line-height: 1.3125rem;
    color: var(--grey-dark);
  }
  &__block {
    display: flex;
    flex-direction: column;
    width: 100%;
    gap: 16px;
  }
  &__line {
    width: 100%;
    height: 1px;
    background: var(--grey);
  }
  &__text {
    font-family: var(--special-font);
    font-size: 1rem;
    line-height: 1.4375rem;
  }
  &__video,
  &__image {
    width: 100%;
    height: 324px;
    @media (max-width: 768px) {
      height: 297px;
    }
  }
  &__links {
    display: flex;
    justify-content: center;
    gap: 16px;
  }
}
</style>
