<script setup>
import NewItem from "@/components/NewItem.vue";
import Paginator from "@/components/Paginator.vue";

const props = defineProps({
  quantity: {
    type: Number,
    default: -1,
  },
  link: {
    type: Boolean,
    default: false,
  },
  bg: {
    type: Boolean,
    default: false,
  },
  title: {
    type: String,
    required: false,
  },
  left: {
    type: Boolean,
    required: false,
  },
});

const items = [
  {
    id: 1,
    title: "Все буде так, як ти захочеш!",
    text: "Антитіла та Марина Бех-Романчук прожили у кадрі ціле життя. Гучна прем’єра від гурту Антитіла. Після танцювальної пісні «Маскарад» [...]",
    data: "10.10.2021",
  },
  {
    id: 2,
    title: "МАСКАРАД - ПРЕМ'ЄРА",
    text: "ПРЕМ’ЄРА! МАСКАРАД! Вже на нашому каналі. Більше п‘ятисот людей в кадрі в образах зомбі, сотні костюмів, кілограми гриму та про [...]",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 1,
    title: "Все буде так, як ти захочеш!",
    text: "Антитіла та Марина Бех-Романчук прожили у кадрі ціле життя. Гучна прем’єра від гурту Антитіла. Після танцювальної пісні «Маскарад» [...]",
    data: "10.10.2021",
  },
  {
    id: 2,
    title: "МАСКАРАД - ПРЕМ'ЄРА",
    text: "ПРЕМ’ЄРА! МАСКАРАД! Вже на нашому каналі. Більше п‘ятисот людей в кадрі в образах зомбі, сотні костюмів, кілограми гриму та про [...]",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 1,
    title: "Все буде так, як ти захочеш!",
    text: "Антитіла та Марина Бех-Романчук прожили у кадрі ціле життя. Гучна прем’єра від гурту Антитіла. Після танцювальної пісні «Маскарад» [...]",
    data: "10.10.2021",
  },
  {
    id: 2,
    title: "МАСКАРАД - ПРЕМ'ЄРА",
    text: "ПРЕМ’ЄРА! МАСКАРАД! Вже на нашому каналі. Більше п‘ятисот людей в кадрі в образах зомбі, сотні костюмів, кілограми гриму та про [...]",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 1,
    title: "Все буде так, як ти захочеш!",
    text: "Антитіла та Марина Бех-Романчук прожили у кадрі ціле життя. Гучна прем’єра від гурту Антитіла. Після танцювальної пісні «Маскарад» [...]",
    data: "10.10.2021",
  },
  {
    id: 2,
    title: "МАСКАРАД - ПРЕМ'ЄРА",
    text: "ПРЕМ’ЄРА! МАСКАРАД! Вже на нашому каналі. Більше п‘ятисот людей в кадрі в образах зомбі, сотні костюмів, кілограми гриму та про [...]",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 1,
    title: "Все буде так, як ти захочеш!",
    text: "Антитіла та Марина Бех-Романчук прожили у кадрі ціле життя. Гучна прем’єра від гурту Антитіла. Після танцювальної пісні «Маскарад» [...]",
    data: "10.10.2021",
  },
  {
    id: 2,
    title: "МАСКАРАД - ПРЕМ'ЄРА",
    text: "ПРЕМ’ЄРА! МАСКАРАД! Вже на нашому каналі. Більше п‘ятисот людей в кадрі в образах зомбі, сотні костюмів, кілограми гриму та про [...]",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
  {
    id: 3,
    title: "День Народження Антитіла - 13 років",
    text: "Нам 13 років! Так, два свята в родині АНТИТІЛА в один день!",
    data: "10.10.2021",
  },
];
</script>

<template>
  <div
    class="new-block wrap-content"
    :style="{ background: bg && 'none' }"
    id="news"
  >
    <container
      :left="left"
      :title="title || 'Новини'"
      :link="link ? { href: 'news', label: 'Всі новини' } : null"
    >
      <div class="new-block__items">
        <new-item
          v-for="item in items.slice(0, quantity)"
          :key="item"
          :item="item"
        />
      </div>
    </container>
    <paginator :totalCount="100" v-show="quantity == -1" />
  </div>
</template>

<style lang="scss" scoped>
.new-block {
  background: var(--bg-grey);
  &__items {
    display: grid;
    grid-template: 1fr / repeat(4, 1fr);
    gap: 32px 24px;
    @media (max-width: 768px) {
      grid-template-columns: repeat(2, 1fr);
      gap: 24px;
    }
    @media (max-width: 480px) {
      grid-template-columns: 1fr;
    }
  }
}
</style>